Autodesk.Revit.DB.ReferencePointArray
An array that contains reference objects.

Autodesk.Revit.DB.ReferencePointArray.Insert(Autodesk.Revit.DB.Reference,System.Int32)
System.Int32
Insert the specified reference into the array.
item: The reference to be inserted into the array.
index: The reference will be inserted before this index.
Returns: Returns whether the reference was inserted into the array.

Autodesk.Revit.DB.ReferencePointArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.ReferencePointArray.ReverseIterator
Autodesk.Revit.DB.ReferencePointArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.ReferencePointArray.ForwardIterator
Autodesk.Revit.DB.ReferencePointArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.ReferencePointArray.Append(Autodesk.Revit.DB.Reference)
void
Add the reference to the end of the array.
item: The reference to be added.

Autodesk.Revit.DB.ReferencePointArray.Clear
void
Removes every reference from the array, rendering it empty.

Autodesk.Revit.DB.ReferencePointArray.Size
System.Int32
get
Returns the number of references that are in the array.

Autodesk.Revit.DB.ReferencePointArray.Item(System.Int32)
Autodesk.Revit.DB.Reference
Gets or sets a reference at a specified index within the array.
index: The index of the reference to be set or retrieved.
Returns: Returns the reference at the specified index.

Autodesk.Revit.DB.ReferencePointArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.